# Courtney Pigford 2/12/2023

In [25]:
import pandas as pd

In [26]:
titanic = pd.read_csv('https://vincentarelbundock.github.io/' + 'Rdatasets/csv/carData/TitanicSurvival.csv')

In [27]:
titanic.head()

                        Unnamed: 0 survived     sex      age passengerClass
0    Allen, Miss. Elisabeth Walton      yes  female  29.0000            1st
1   Allison, Master. Hudson Trevor      yes    male   0.9167            1st
2     Allison, Miss. Helen Loraine       no  female   2.0000            1st
3  Allison, Mr. Hudson Joshua Crei       no    male  30.0000            1st
4  Allison, Mrs. Hudson J C (Bessi       no  female  25.0000            1st

In [28]:
titanic.tail()

                     Unnamed: 0 survived     sex   age passengerClass
1304       Zabour, Miss. Hileni       no  female  14.5            3rd
1305      Zabour, Miss. Thamine       no  female   NaN            3rd
1306  Zakarian, Mr. Mapriededer       no    male  26.5            3rd
1307        Zakarian, Mr. Ortin       no    male  27.0            3rd
1308         Zimmerman, Mr. Leo       no    male  29.0            3rd

In [29]:
titanic.columns = ['name', 'survived', 'sex', 'age', 'class']

In [30]:
titanic.head()

                              name survived     sex      age class
0    Allen, Miss. Elisabeth Walton      yes  female  29.0000   1st
1   Allison, Master. Hudson Trevor      yes    male   0.9167   1st
2     Allison, Miss. Helen Loraine       no  female   2.0000   1st
3  Allison, Mr. Hudson Joshua Crei       no    male  30.0000   1st
4  Allison, Mrs. Hudson J C (Bessi       no  female  25.0000   1st

In [31]:
titanic.tail()

                           name survived     sex   age class
1304       Zabour, Miss. Hileni       no  female  14.5   3rd
1305      Zabour, Miss. Thamine       no  female   NaN   3rd
1306  Zakarian, Mr. Mapriededer       no    male  26.5   3rd
1307        Zakarian, Mr. Ortin       no    male  27.0   3rd
1308         Zimmerman, Mr. Leo       no    male  29.0   3rd

In [32]:
titanic.describe()

               age
count  1046.000000
mean     29.881135
std      14.413500
min       0.166700
25%      21.000000
50%      28.000000
75%      39.000000
max      80.000000

In [33]:
(titanic.survived == 'yes').describe()

count      1309
unique        2
top       False
freq        809
Name: survived, dtype: object

In [34]:
%matplotlib

Using matplotlib backend: MacOSX

In [35]:
histogram = titanic.hist()